Repository: blue0316/Ridy-flutter
Catalog: apps/driver-app/lib/l10n/intl_*.arb
Languages: am, ar

# statusOffline
source: Go Online
am: ኦንላይን ይግቡ
ar: بحث عن رحلات

# statusOnline
source: Go Offline
am: ይዝጉ/Off.
ar: إيقاف البحث

# message_notification_permission_title
source: Notification Permission
am: የማሳወቂያ ፍቃድ
ar: السماح للتنبيهات

# message_notification_permission_denined_message
source: Notification permission was denied previously. In order to get new order notifications, you can enable the permission from app settings.
am: የማሳወቂያ ፍቃድ ቀደም ብሎ ተከልክሏል። አዲስ የትዕዛዝ ማሳወቂያዎችን ለማግኘት ከመተግበሪያ ቅንብሮች ፈቃዱን ማንቃት ይችላሉ።
ar: تم رفض إذن الإعلام سابقا. من أجل الحصول على إشعارات الطلبات الجديدة ، يمكنك تمكين الإذن من إعدادات التطبيق.

# menu_logout
source: Logout
am: ይውጡ
ar: تسجيل الخروج

# menu_about
source: About
am: ስለ እኛ
ar: حول

# menu_wallet
source: Wallet
am: ዋሌት
ar: المحفظة

# menu_trip_history
source: Trip History
am: የጉዞ ታሪክ
ar: تاريخ الرحلات

# menu_announcements
source: Announcements
am: ማስታወቂያዎች
ar: الإشعارات

# message_unknown_error
source: Unknown error
am: ያልታወቀ ስህተት
ar: خطأ غير معروف

# driver_register_profile_submitted_message
source: Your profile is submitted for admin approval. You can check back later to see the status of your submission.
am: ፕሮፋይልዎ ለአስተዳዳሪ ለመጽደቅ ገብቷል። ያቀረቡትን ሁኔታ ለማየት ቆይተው ማየት ይችላሉ።
ar: تم ارسال الطلب للمراجعةوالتدقيق. سوف يتم تحديث حالة الطلب قريباً

# driver_registration_approved_demo_mode
source: Normally, at this stage admin would need to approve the driver's submission from the Admin Panel. However, for the sake of the demo, your profile is automatically approved now and is ready to use.
am: በተለምዶ፣ በዚህ ደረጃ አስተዳዳሪ የአሽከርካሪውን ከአስተዳዳሪ ፓነል ማጽደቅ አለበት። እባክዎን በማንኛውም ጊዜ በ +251913818893 ይደውሉ ዎይም በኢ፟መይል አድራሻችን ይፃፉልን siadali123@gmail.com
ar: للتجربة فقط

# title_important
source: IMPORTANT!
am: ጠቃሚ
ar: !مهم

source: Cell Number
am: ስልክ ቁጥር
ar: رقم الجوال

# phone_number_empty
source: Please enter the phone number
am: እባኮትን ስልክ ቁጥሩን ያስገቡ
ar: ادخل رقم الجوال

# driver_registration_step_verify_number_title
source: Verify Number
am: ቁጥር ያረጋግጡ
ar: رمز التأكيد

# driver_register_verification_code_textfield_hint
source: Verification code
am: የማረጋገጫ የሚስጥር ቁጥር
ar: رمز التأكيد

# driver_register_contact_details_title
source: Contact Details
am: የአድራሻ ዝርዝሮች
ar: معلومات التواصل

source: First Name
am: የመጀመሪያ ስም
ar: الاسم الأول

source: Last Name
am: የአባት ስም
ar: الاسم الأخير

source: E-Mail
am: ኢ-ሜይል
ar: الايميل

source: Certificate Number
am: የመንጃ ፍቃድ ቁጥር
ar: رقم الوثيقة

source: Gender
am: ፆታ
ar: الجنس

# gender_male
source: Male
am: ወንድ
ar: ذكر

# gender_female
source: Female
am: ሴት
ar: انثى

source: Address
am: አድራሻ
ar: العنوان

# driver_register_ride_details_step_title
source: Ride Details
am: የጉዞ ዝርዝሮች
ar: معلومات المركبة

source: Plate Number
am: የሰሌዳ ቁጥር
ar: رقم اللوحة

# car_production_year
source: Production Year
am: የምርት ዓመት
ar: سنة الصنع

source: Car Model
am: የመኪና ሞዴል
ar: نوع السيارة

source: Car Color
am: የመኪና ቀለም
ar: لون السيارة

# driver_register_step_payout_details_title
source: Payout Details
am: የክፍያ ዝርዝሮች
ar: معلومات الدفع

source: Bank Name
am: የባንክ ስም
ar: اسم البنك

source: Account Number
am: አካዉንት ቁጥር
ar: رقم الحساب

source: Bank Swift
am: የባንክ ስዊፍት
ar: (Swift) رمز البنك

source: Bank Routing Number
am: የባንክ መስመር ቁጥር
ar: رقم تحويل البنك

# driver_register_step_documents_title
source: Documents
am: ሰነዶች
ar: المرفقات

# driver_register_step_documents_heading
source: In order to verify above documents, we require below documents being uploaded
am: ከላይ ያሉትን ሰነዶች ለማረጋገጥ ከታች የሚሰቀሉ ሰነዶችን እንፈልጋለን
ar: للتأكد من صحة البيانات اعلاه نرجو رفع الملفات التالية

# driver_register_document_second
source: 2-Driver License
am: 2-የመንጃ ፍቃድ
ar: رخصة القيادة

# driver_register_document_third
source: 3-Ride's Ownership document
am: 3-Ride's ባለቤትነት ሰነድ
ar: استمارة المركبة

# action_upload_document
source: Upload Document
am: ሰነድ ስቀል
ar: رفع الملفات

# trip_history_empty_state
source: No past order has been recorded.
am: ያለፈ ትእዛዝ አልተመዘገበም።
ar: لا يوجد رحلات سابقة

# wallet_empty_state_message
source: No history recorded.
am: ምንም ታሪክ አልተመዘገበም።
ar: لا دفعات سابقة

# enum_unknown
source: Unkonwn
am: የማይታወቅ
ar: غير معروف

# top_up_sheet_pay_button
source: Pay
am: ይክፈሉ
ar: ادفع

source: LOADING
am: በመጫን ላይ
ar: جار التحميل

# available_order_action_accept
source: Accept Order
am: ትዕዛዝ ተቀበል
ar: قبول الطلب

# order_status_action_received_cash
source: Cash Payment received
am: የገንዘብ ክፍያ ተቀብሏል።
ar: تم استلام المبلغ نقدياً

# action_cancel
source: Cancel
am: ሰርዝ
ar: إلغاء

# order_status_action_arrived
source: Arrived
am: ደሪሻሎው
ar: تم الوصول

# order_status_action_start
source: Start Trip
am: ጉዞ ጀምር
ar: بدأ الرحلة

# order_status_action_finished
source: Finish
am: ይጨርሱ
ar: تم اكمال الرحلة

# message_cant_open_url
source: Command is not supported
am: ትዕዛዝ አይደገፍም።
ar: لا يمكن فتح الروابط

# enum_driver_recharge_type_bank_transfer
source: Bank Transfer
am: በባንክ ማስተላለፍ
ar: تحويل بنكي

# enum_driver_recharge_type_gift
source: Gift
am: ስጦታ
ar: هدية

# enum_driver_recharge_type_in_app_payment
source: In-App Payment
am: የውስጠ-መተግበሪያ ክፍያ
ar: دفع من خلال التطبيق

# enum_driver_recharge_transaction_type_order_fee
source: Order Fee
am: የክፍያ ትዕዛዝ
ar: رسوم القيمة المضافة

# enum_driver_deduct_transaction_type_correction
source: Correction
am: እርማት
ar: تصحيح

# enum_driver_deduct_transaction_type_commission
source: Commission
am: ኮሚሽን
ar: العمولة

# copyright_notice
source: Copyright Â© {company}, All rights reserved.
am: የቅጂ መብት © {company}, መብቱ በህግ የተጠበቀ ነው።
ar: {company} © كل الحقوق محفوظة لشركة

# wallet_activities_heading
source: Activities
am: ተግባራት
ar: أنشطة

# form_required_field_error
source: Required field
am: መሞላት ያለበት
ar: حقل مطلوب

# button_report_issue
source: Report an issue
am: ችግርን ሪፖርት ያድርጉ
ar: ابلاغ عن مشكلة

# issue_submit_title
source: Report an issue
am: ችግርን ሪፖርት ያድርጉ
ar: ابلاغ عن مشكلة

# issue_subject_placeholder
source: Subject
am: ርዕሰ ጉዳይ
ar: الموضوع

# error_field_cant_be_empty
source: Can not be empty
am: ባዶ መሆን አይቻልም
ar: لا يمكن أن يكون فارغ

# issue_description_placeholder
source: Description
am: መግለጫ
ar: وصف

# complaint_submit_success_message
source: Complaint is submitted. Please wait for a contact from our support representative about your inquiry.
am: ቅሬታ ቀርቧል። እባክዎን ስለጥያቄዎ የድጋፍ ወኪላችንን ለማግኘት ይጠብቁ።
ar: تم رفع الشكوى. سوف يتم التواصل معك عن طريق الدعم الفني قريباً

# menu_earnings
source: Earnings
am: ገቢዎ
ar: المكاسب

# status_offline_description
source: Get online to see requests
am: የጉዞ ትዛዞችን ለመቀበል ኦላይን ይግቡ/ አገልግሎት መስጠት ይጀምሩ።
ar: ابحث عن رحلات

# status_online_description
source: Searching for ride
am: ትጓዥ በመፈለግ ላይ
ar: بحث عن طلب

# order_status_card_title_driver_accepted
source: Rider will be notified once you tap Arrived
am: ደሪሻሎው የሚለውን ስጫኑ ለተሳፋሪዉ ማሳወቂያ ይደርሰዋል።
ar: سوف يتم اشعار صاحب الطب عند الضغط على تم الوصول

# order_status_card_title_arrived
source: Rider has been notified
am: ተሳፋሪው ማሳወቂያ ደርሶታል።
ar: تم اشعار صاحب/ة الطلب

# order_status_card_title_started
source: Heading to destination
am: ወደ መድረሻው በመሄድ ላይ
ar: الذهاب للوجهة

# navigation_dialog_title
source: Choose an app to navigate with
am: የሚሄዱበትን መተግበሪያ ይምረጡ
ar: اختيار التتبع عن طريق:

# action_ride_options
source: Ride Options
am: የጉዞ አማራጮች
ar: خيارات الرحلة

# rider_expected_time_past
source: Rider expected you {minutes} mins ago
am: Rider expected you {minutes} ago
ar: {minutes} مدة التأخير

# rider_expected_time_future
source: Rider expects you in {minutes} mins
am: Rider expects you in {minutes}
ar: {minutes} الوقت للوصول

# order_payment_status_unpaid
source: Ride hasn't been paid yet
am: ጉዞ እስካሁን አልተከፈለም።
ar: لم يتم دفع المبلغ

# order_payment_status_paid
source: Ride Has been paid
am: የጉዞው ህሳብ ተከፍሏል
ar: تم دفع المبلغ

# action_ride_preferences
source: Rider Preferences
am: የአሽከርካሪ ምርጫዎች
ar: تفضيلات الراكب

# navigation_dialog_title_pickup_point
source: Navigate to pickup point
am: ወደ መውሰጃ ቦታ ሂድ
ar: الذهاب لموقع الطلب

# navigation_title_destination_point
source: Navigate to drop off point
am: ወደ መውረጃ ነጥብ ሂድ
ar: الذهاب لموقع الوصول

# rider_options_dialog_title
source: Ride Options
am: የጉዞ አማራጮች
ar: خيارات الرحلة

# action_cancel_ride
source: Cancel Ride
am: ጉዞ ይሰርዙ
ar: إلغاء الرحلة

# invoice_dialog_body
source: You can also receive cash instead of an online payment if you and the rider are both willing to.
am: እርስዎ እና ተሳፋሪዉ ሁለታችሁም ፈቃደኛ ከሆናችሁ በመስመር ላይ ክፍያ ምትክ ጥሬ ገንዘብ መቀበል ትችላላችሁ።
ar: تستطيع استلام المبلغ نقدياً في حال تم الاتقاق

# invoice_dialog_heading
source: Waiting for rider payment
am: ክፍያ በመጠበቅ ላይ
ar: انتظار الدفع

# invoice_dialog_title
source: Payment Info
am: የክፍያ መረጃ
ar: معلومات الدفع

# invoice_item_tip
source: Tip
am: ትፕ
ar: عمولة اضافية

# invoice_item_subtotal
source: Subtotal
am: አጠቃላይ
ar: المجموع

# add_credit_dialog_title
source: Add Credit
am: ክሬዲት ይጨምሩ
ar: اضافة بطاقة

# add_credit_dialog_select_payment_method
source: Select Payment Method:
am: የመክፈያ ዘዴን ይምረጡ፡-
ar: تحديد طريقة الدفع

# add_credit_dialog_chose_amount
source: Chose amount
am: መጠን ይምረጡ
ar: اختيار القيمة

# order_details_payment_method_title
source: Payment Method
am: የመክፈያ ዘዴ
ar: وسيلة الدفع

# order_payment_method_cash
source: Cash
am: ጥሬ ገንዘብ
ar: نقدي

# order_payment_method_online
source: Online
am: ኦንላይን
ar: عبر التطبيق

# order_details_trip_information_title
source: Trip Information
am: የጉዞ መረጃ
ar: معلومات الرحلة

# issue_submit_body
source: You can report any issue you had with your ride. We will help you with the issue within a call.
am: በጉዞዎ ላይ ያለዎትን ማንኛውንም ችግር ሪፖርት ማድረግ ይችላሉ። በጉዳዩ ላይ በጥሪ እንረዳዎታለን።
ar: تستطيع الابلاغ عن أي اشكالية وسوف نتواصل معك في اقرب فرصة

# announcements_empty_state_title
source: No Announcements yet!
am: እስካሁን ምንም ማስታወቂያዎች የሉም!
ar: لا يوجد اشعاارات

# announcements_empty_state_body
source: We will notify you when new announcements comes.
am: አዲስ ማስታወቂያዎች ሲመጡ እናሳውቅዎታለን።
ar: سوف يتم اشعارك عند وصول أي اشعار

# empty_state_title_no_record
source: No Data Found!
am: ምንም አይነት መረጃ አልተገኘም!
ar: لا يوجد بيانات

# earnings_empty_state_body
source: At the criteria set above, we can't find any records.
am: ከላይ በተቀመጠው መስፈርት ምንም አይነት መዝገቦችን ማግኘት አልቻልንም።
ar: لا يمكن ايجاد أي معلومات بالخيارات اعلاه

# action_continue
source: Continue
am: ይቀጥሉ
ar: المتابعة

# terms_and_condition_first_part
source: I have read and agree with
am: አንብቤ ተስማምቻለሁ
ar: قرأت ومواقق

# terms_and_conditions_clickable_part
source: Terms & Conditions
am: ውሎች እና ሁኔታዎች
ar: الشروط والاحكام

# onboarding_welcome
source: Welcome !
am: እንኳን ደህና መጣህ !
ar: هلا

# action_login_signup
source: Login / Sign Up
am: ይግቡ / ይመዝገቡ
ar: تسجيل الدخول/ تسجيل جديد

# action_complete_registration
source: Complete registration
am: የተሟላ ምዝገባ
ar: اكمال التسجيل

# action_edit_submission
source: Edit submission
am: የተላኩትን መርጃ ያሪሙ
ar: تعديل الطلب

# incomplete_registration_description
source: Please complete your registration submission
am: እባክዎን ያጠናቅቁ የምዝገባ አቀራረቡን
ar: نرجو اكمال معلومات الطلب

# pending_review_registration_description
source: Your submission is under review, Thanks for patience.
am: ያስገቡት በግምገማ ላይ ነው፣ ለትዕግስት እናመሰግናለን።
ar: طلبك تحت المراجعة. شكراً للانتظار

# hard_reject_registration
source: Your Submission is fully rejected!
am: ያስገቡት ሙሉ በሙሉ ተቀባይነት አላገኘም!
ar: تم رفض طلبك

# soft_rejection_description
source: There is a problem with the submission
am: የላኩት መርጃ ላይ ችግር አለ።
ar: هنالك اشكالية مع الطلب

# action_confirm_and_continue
source: Confirm & Continue
am: ያረጋግጡ እና ይቀጥሉ
ar: تأكيد ومتابعة

# ride_preferences_title
source: Ride Preferences
am: የተሳፋሪ ምርጫዎች
ar: خيارات الرحلة

# action_back
source: Back
am: ወደ ኋላ
ar: الخلف

# title_logout
source: Logout
am: ይውጡ
ar: تسجيل الخروج

# logout_dialog_body
source: Are you sure you want to log out of the application?
am: እርግጠኛ ነዎት ከመተግበሪያው መውጣት ይፈልጋሉ?
ar: هل أنت متأكد من تسجيل الخروج؟

# action_delete_account
source: Delete Account
am: መለያ ሰረዛ
ar: حذف الحساب

# dialog_account_deletion_title
source: Account deletion
am: መለያ ሰረዛ
ar: حذف الحساب

# dialog_account_deletion_body
source: Are you sure you want to delete your account? You can log in again within 30 days to restore the account. After this period, your data gets completely removed, including all your remaining credits.
am: እርግጠኛ ነህ መለያህን መሰረዝ ትፈልጋለህ? መለያውን ወደነበረበት ለመመለስ በ30 ቀናት ውስጥ እንደገና መግባት ይችላሉ። ከዚህ ጊዜ በኋላ፣ ሁሉንም ቀሪ ክሬዲቶችዎን ጨምሮ ሙሉ በሙሉ ይወገዳል።
ar: هل أنت متأكد من حذف الحساب؟ تستطيع الدخول خلال 30 يوم لتنشيط الحساب. بعد هذه المدة سيتم حذف الحساب مع كافة بياناته شاملاً ذلك المبالغ المتبقية

# wallet_card_title
source: {appName} Wallet
am: {appName} ዋሌት
ar: {appName} المحفظة

# order_status_canceled
source: Canceled
am: ተሰርዟል።
ar: إلغاء

# driver_register_title
source: Driver Registration
am: የአሽከርካሪዎች ምዝገባ
ar: تسجيل السائق

# menu_profile
source: My profile
am: የግል ማህደሬ
ar: ملفي

# profile_services_title
source: Services:
am: አገልግሎቶች፡

# profile_bank_information_title
source: Bank Information
am: የባንክ መረጃ

# profile_vehicle_information_title
source: Vehicle Information
am: የመኪና መረጃ

# profile_distance_traveled
source: Distance traveled
am: የተጓዙት ርቅት

# profile_total_trips
source: Total trips
am: ጠቅላላ ጉዞዎች

# profile_rating
source: Rating
am: ደረጃ መስጠት

# action_add_photo
source: Add photo
am: ፎቶ ያክሉ
ar: إضافة صورة

# action_ok
source: OK
ar: موافق

# title_success
source: Success
ar: تمت العملية

# driver_register_document_first
source: 1-ID
ar: بطاقة الهوية/الإقامة

# order_status_action_navigate
source: Navigate
ar: تتبع

# enum_driver_deduct_transaction_type_withdraw
source: Withdraw
ar: سحب

# request_card_distance
source: {distance} km Away
ar: {distance} km يبعد
