Repository: blue0316/Ridy-flutter
Catalog: apps/rider-app/lib/l10n/intl_*.arb
Languages: am, ar, fa, hy

# cancelation_fee_confirmation_body
source: Cancelation of service after the driver has accepted the trip is subject to a cancellation penalty of {fee}. Do you confirm?
am: አሽከርካሪው ጉዞውን ከተቀበለ በኋላ የአገልግሎቱን መሰረዝ የመሰረዝ ቅጣት ይጣልበታል {fee}. አረጋግጠዋል?
ar: {fee} الإلغاء بعد قبول قائد المركبة قد يعرضك لرسوم
fa: Cancelation of service after driver has accepted the trip is subject to cancellation penalty of {fee}. Do you confirm?
hy: Ծառայության չեղարկումը այն բանից հետո, երբ վարորդն ընդունել է ուղևորությունը, ենթակա է չեղարկման տույժի՝ {fee}: Դուք հաստատո՞ւմ եք:

source: Confirm
am: ያረጋግጡ
ar: التأكيد
fa: تائید
hy: Հաստատել

# add_credit_select_payment_method
source: Select Payment Method:
am: የመክፈያ ዘዴን ይምረጡ፡-
ar: تحديد طريقة الدفع
fa: درگاه پرداخت را انتخاب کنید:
hy: Ընտրեք վճարման եղանակը.

# add_credit_custom_credit_placeholder
source: Add Custom Credit
am: ብጁ ክሬዲት ይጨምሩ
ar: اضف بطاقة الدفع
fa: شارژ مازاد
hy: Ավելացնել անհատական վարկ

# add_credit_custom_credit_text_placeholder
source: Custom
am: ብጁ
ar: تخصيص
fa: مقدار
hy: Պատվերով

# invoice_item_tip
source: Tip
am: ትፕ
ar: عمولة
fa: انعام
hy: Հուշում

# invoice_item_wallet
source: Wallet
am: ዋሌት
ar: المحفظة
fa: کیف پول
hy: Դրամապանակ

# invoice_item_total
source: Total
am: ጠቅላላ
ar: المجموع
fa: جمع
hy: Ընդամենը

# add_credit_dialog_title
source: Add Credit
am: ክሬዲት ይጨምሩ
ar: اضف بطاقة
fa: شارژ حساب
hy: Ավելացնել վարկ

# add_credit_chose_amount
source: Chose amount
am: መጠኑን ይምረጡ
ar: تحديد القيمة
fa: مقدار را وارد کنید
hy: Ընտրեք գումարը

# action_ride_preferences
source: Ride Preferences
am: የጉዞ ምርጫዎች
ar: خيارات الرحلة
fa: ترجیحات سفر
hy: Ուղևորության նախապատվություններ

# ride_preferences_title
source: Ride Preferences
am: የጉዞ ምርጫዎች
ar: خيارات الرحلة
fa: ترجیحات سفر
hy: Ուղևորության նախապատվություններ

# action_confirm_and_continue
source: Confirm & Continue
am: ያረጋግጡ እና ይቀጥሉ
ar: الموافقة والاستمرار
fa: تائید و ادامه
hy: Հաստատել և շարունակել

# action_see_reserved_rides
source: See reserved rides
am: የተያዘውን ጉዞ ይመልከቱ
ar: الحجوزات المستقبلية
fa: دیدن سفرهای رزرو شده
hy: Տես վերապահված երթուղիները

# ride_reserved_dialog_title
source: Your ride is reserved.
am: የእርስዎ ጉዞ የተጠበቀ ነው።
ar: تم حجز رحلتك
fa: سفر شما رزرو شد
hy: Ձեր ուղևորությունը վերապահված է:

# ride_reserved_dialog_body
source: You can check out reserved rides in the menu to see reserve information of this ride.
am: የዚህን ጉዞ የተያዙ መረጃዎችን ለማየት በmenu ውስጥ የተያዙ ጉዞዎችን መመልከት ይችላሉ።
ar: يمكنك معرفة رحلاتك المستقبلية
fa: شما می توانید به منو سفرهای رزرو شده جهت مشاهده ی آن ها مراجعه کنید.
hy: Դուք կարող եք ստուգել վերապահված ուղևորությունները մենյուում՝ այս ուղևորության մասին տեղեկությունները տեսնելու համար:

# alert_coupon_unavailable
source: Coupon is unavailable
am: ኩፖን የለም።
ar: ليس متوفر
fa: کوپن در دسترس نیست.
hy: Կտրոնն անհասանելի է

# minutes_format
source: {minutes} minutes
ar: {minutes} دقيقة
fa: {minutes} دقیقه
hy: {րոպե} րոպե

# action_back
source: Back
am: ተመለስ
ar: الخلف
fa: برگشت
hy: Ետ

# wallet_card_title
source: {appName} Wallet
am: {appName} ዋሌት
ar: {appName} المحفظة
fa: {appName} کیف پول
hy: {appName} դրամապանակ

# action_redeem_gift_card
source: Redeem Gift Card
am: የስጦታ ካርድ ይውሰዱ
ar: استخدم رمز الخصم
fa: فعال سازی کارت هدیه
hy: Փրկեք նվեր քարտը

# order_status_canceled
source: Canceled
am: ተሰርዟል።
ar: ألغيت
fa: کنسل شده
hy: Չեղարկված է

# action_skip_for_now
source: Skip for now
am: ለአሁን ይዝለሉት
ar: تخطي في الوقت الراهن
fa: فعلا نه!
hy: Առայժմ բաց թողեք

# onboarding_select_language_title
source: Select Language
am: ቋንቋ ይምረጡ
ar: اختار اللغة
fa: انتخاب زبان
hy: Ընտրել լեզուն

# onboarding_first_page_title
source: Welcome to {appName}!
am: እንኳን በደህና መጡ ወደ {appName}!
ar: مرحبًا بك في {appName}!
fa: به {appName} خوش آمدید!
hy: Բարի գալուստ {appName}:

# onboarding_first_page_body
source: Taxi service designed for your comfort have Trips with your favorite drivers and chose your ride preferences
am: ብሉ ራይድ ለእርስዎ ምቾት የተነደፈ የታክሲ አገልግሎት ከሚወዷቸው ሾፌሮች ጋር ጉዞ ያድርጉ እና የመጓጓዣ ምርጫዎችዎን ይምረጡ
ar: خدمة سيارات الأجرة مصممة لراحتك احصل على رحلات مع السائقين المفضلين لديك واختر ما تفضله
fa: خدمات تاکسی برای راحتی شما با رانندگان مورد علاقه ت سفر برو و سفرهات رو مطابق میلت تنظیم کن
hy: Ձեր հարմարավետության համար նախատեսված տաքսի ծառայություն Ուղևորություններ կատարեք ձեր սիրելի վարորդների հետ և ընտրեք ձեր երթևեկության նախասիրությունները

# onboarding_second_page_title
source: Get rewarded!
am: አሁኑኑ ይሸለሙ!
ar: تحصل على مكافأة!
fa: جایزه بگیر!
hy: Ստացեք պարգևատրում:

# onboarding_second_page_body
source: get extra bonuses for referring a friend, completing trips and many more...
am: ለጓደኛዎ በመላክ ፣ ጉዞዎችን ለማጠናቀቅ እና ሌሎች ብዙ ተጨማሪ ጉርሻዎችን ያግኙ...
ar: احصل على مكافآت إضافية لإحالة صديق وإكمال الرحلات وغيرها الكثير ...
fa: با معرفی به دوستات و استفاده از خدمات اپ اعتبار کسب کن و جایزه بگیر.
hy: ստացեք հավելյալ բոնուսներ ընկերոջը ուղղորդելու, ուղևորություններ ավարտելու և շատ ավելին...

# onboarding_sign_in_title
source: Sign in
ar: تسجيل الدخول
fa: ورود به حساب
hy: Մուտք գործել

# onboarding_sign_in_body
source: A few seconds away from signing in and starting a comfortable ride
am: ለመግባት እና ምቹ ጉዞ ለመጀመር ጥቂት ሰከንዶች ቀርተውታል።
ar: على بعد ثوانٍ قليلة من تسجيل الدخول وبدء رحلة مريحة
fa: چند ثانیه مانده به ورود به حساب و درخواست سفر راحت.
hy: Մուտք գործելուց և հարմարավետ ճանապարհորդություն սկսելուց մի քանի վայրկյան է մնացել
