Repository: blue0316/Ridy-flutter
Catalog: apps/rider-app/lib/l10n/intl_*.arb
Languages: am, ar, fa, hy

source: Loading
am: በመጫን ላይ..
ar: تحميل
fa: بارگذاری
hy: Բեռնվում է

# wallet_empty_state_message
source: No history recorded.
am: ምንም የተመዘገበ ታሪክ የለም።
ar: لا يوجد بيانات سابقة
fa: هیچ سابقه ای ثبت نشده است.
hy: Պատմություն չի գրանցվել:

# enum_rider_transaction_deduct_order_fee
source: Order Fee
am: የክፍያ ትዕዛዝ
ar: ضريبة القيمة المضافة
fa: سفارش رایگان
hy: Պատվերի վճար

# enum_rider_transaction_deduct_withdraw
source: Withdraw
am: ገንዘብ ማውጣት
ar: سحب
fa: کنار کشیدن
hy: Հանել

# enum_rider_transaction_deduct_correction
source: Correction
am: እርማት
ar: تصحيح
fa: تصحیح
hy: Ուղղում

# enum_unknown
source: Unkonwn
ar: غير معروف
fa: ناشناس
hy: Անհայտ

# enum_rider_transaction_recharge_in_app_payment
source: In-app Payment
am: የውስጠ-መተግበሪያ ክፍያ
ar: الدفع من خلال التطبيق
fa: پرداخت درون برنامه ای
hy: Ներծրագրի վճարում

# enum_rider_transaction_recharge_gift
source: Gift
am: ስጦታ
ar: هدية
fa: هدیه
hy: Նվեր

# enum_rider_transaction_recharge_correction
source: Correction
am: እርማት
ar: تصحيح
fa: تصحیح
hy: Ուղղում

# enum_rider_transaction_recharge_bank_transfer
source: Bank Transfer
am: በባንክ ያስተላልፉ
ar: تحويل بنكي
fa: حواله بانکی
hy: Բանկային փոխանցում

# top_up_sheet_pay_button
source: Pay
am: ይክፈሉ
ar: ادفع
fa: پرداخت
hy: Վճարել

# service_selection_book_now
source: Book Now
am: አሁን ይዘዙ
ar: احجز الآن
fa: اکنون ثبت کن
hy: Ամրագրեք հիմա

# action_cancel
source: Cancel
am: ሰርዝ
ar: إلغاء
fa: لغو کنید
hy: Չեղարկել

# copyright_notice
source: Copyright Â© {company}, All rights reserved.
am: የቅጂ መብት © {company}, 2022 መብቱ በህግ የተጠበቀ ነው።
ar: {company} © كل الحقوق محفوظة لشركة
fa: حق نشر © {company}، بسیار خوب محفوظ است.
hy: Հեղինակային իրավունք © {company}, Բոլոր իրավունքները պաշտպանված են:

# menu_about
source: About
am: ስለእኛ
ar: حول
fa: در باره
hy: Մասին

# menu_login
source: Login
am: ይግቡ
ar: تسجيل الدخول
fa: وارد شدن
hy: Մուտք գործել

# menu_profile
source: Profile
am: ፕሮፋይል
ar: الملف الشخصي
fa: مشخصات
hy: Անձնագիր

# menu_wallet
source: Wallet
am: ዋሌት
ar: المحفظة
fa: کیف پول
hy: Դրամապանակ

# menu_trip_history
source: Trip History
am: የጉዞ ታሪክ
ar: تاريخ الرحلات
fa: تاریخچه سفر
hy: Ուղևորության պատմություն

# menu_announcements
source: Announcements
am: ማስታወቂያዎች
ar: الإشعارات
fa: اطلاعیه ها
hy: Հայտարարություններ

# menu_saved_locations
source: Saved Locations
am: Saved የተደረጉ ቦታዎች
ar: الأماكن المحفوظة
fa: مکان های ذخیره شده
hy: Պահված վայրեր

# action_save
source: Save
ar: حفظ
fa: ذخیره
hy: Պահպանել

# create_address_name_empty_error
source: Please enter name of location
am: እባክዎን የአካባቢ ስም ያስገቡ
ar: الرجال ادخال اسم الموقع
fa: لطفا نام مکان را وارد کنید
hy: Խնդրում ենք մուտքագրել գտնվելու վայրը

# create_address_title_textfield_hint
source: Title
am: ርዕስ
ar: العنوان
fa: عنوان
hy: Կոչում

# action_delete
source: Delete
ar: حذف
fa: حذف
hy: Ջնջել

# trip_history_empty_state_message
source: No past order has been recorded.
am: ምንም ያለፈ ትዕዛዝ አልተመዘገበም።
ar: لا يوجد بيانات سابقة
fa: هیچ سفارش قبلی ثبت نشده است.
hy: Նախկին պատվեր չի գրանցվել:

# profile_firstname
source: First Name
am: መጠሪያ ስም
ar: الاسم الأول
fa: نام کوچک
hy: Անուն

# profile_lastname
source: Last Name
am: ያኣባት ስም
ar: الاسم الأخير
fa: نام خانوادگی
hy: Ազգանուն

# profile_email
source: E-Mail
am: ኢ-ሜይል
ar: الايميل
fa: پست الکترونیک
hy: Էլեկտրոնային փոստ

# profile_gender
source: Gender
am: ጾታ
ar: الجنس
fa: جنسیت
hy: Սեռ

# enum_gender_male
source: Male
am: ወንድ
ar: ذكر
fa: نر
hy: Արական

# enum_gender_female
source: Female
am: ሴት
ar: انثى
fa: مونث
hy: իգական

# login_cell_number_textfield_hint
source: Cell Number
am: ስልክ ቁጥር
ar: رقم الجوال
fa: شماره همراه
hy: Հեռախոսի համար

# login_cell_number_empty_error
source: Please enter the phone number in correct format
am: እባክዎን ስልክ ቁጥሩን በትክክለኛው ቅርጸት ያስገቡ
ar: الرجال ادخال رقم الجوال بصيغة صحيحة
fa: لطفا شماره تلفن را با فرمت صحیح وارد کنید
hy: Խնդրում ենք մուտքագրել հեռախոսահամարը ճիշտ ձևաչափով

# action_next
source: Next
ar: التالي
fa: بعد
hy: Հաջորդը

# verify_phone_code_empty_message
source: Verification code is not entered.
am: የማረጋገጫ ኮድ አልገባም።
ar: لم يتم ادخال رمز التحقق
fa: کد تایید وارد نشده است.
hy: Ստուգման կոդը մուտքագրված չէ:

# wallet_activities_heading
source: Activity
ar: تفعيل
fa: فعالیت ها
hy: Գործունեություն

# menu_logout
source: Logout
am: ይውጡ
ar: تسجيل الخروج
fa: خروج از حساب
hy: Դուրս գալ

# enum_gender_unknown
source: Unknown
am: የማይታወቅ
ar: غير معروف
fa: نامشخص
hy: Անհայտ

# enum_address_type_home
source: Home
ar: الرئيسي
fa: خانه
hy: տուն

# enum_address_type_work
source: Work
ar: العمل
fa: محل کار
hy: Աշխատանք

# enum_address_type_partner
source: Partner
ar: شركاء
fa: شریک
hy: Գործընկեր

# enum_address_type_other
source: Other
ar: اخرى
fa: دیگر
hy: Այլ

# message_notification_permission_denined_message
source: Notification permission was denied previously. In order to get new order\'s notifications, you can enable the permission from app settings.
am: የማሳወቂያ ፈቃድ ቀደም ብሎ ተከልክሏል። አዲስ ትዕዛዝ ለማግኘት\ ማሳወቂያዎች, ፈቃዱን ከመተግበሪያ ቅንጅቶች ማንቃት ይችላሉ።
ar: لم يتم السماح باستقبال الاشعارات. تستطيع التفعيل الآن عن طريق الإعدادات In order to get new order\'s notifications you can enable the permission from app settings.
fa: دسترسی به نوتیفیکیشن ها غیر فعال است. جهت فعال کردن به تنظیمات مراجعه کنید.
hy: Նախկինում ծանուցման թույլտվությունը մերժվել էր: Նոր պատվերի մասին ծանուցումներ ստանալու համար կարող եք միացնել թույլտվությունը հավելվածի կարգավորումներից:

# message_notification_permission_title
source: Notification Permission
am: የማሳወቂያ ፍቃድ
ar: السماح بالتنبيهات،
fa: دسترسی به نوتیفیکشن
hy: Ծանուցման թույլտվություն

# action_ok
source: OK
am: እሺ
ar: موافق
fa: تایید
hy: լավ

# menu_website
source: Website
ar: الموقع
fa: وب سایت
hy: Կայք

# action_confirm_and_reserve_ride
source: Confirm & Reserve ride
am: ያረጋግጡ እና ጉዞ ያስይዙ
ar: التأكيد وحجز رحلة
fa: تایید و رزور
hy: Հաստատեք և ամրագրեք ուղևորությունը

# title_reserve_ride
source: Reserve Ride
am: ጉዞ ያስይዙ
ar: حجز رحلة
fa: رزرو سفر
hy: Պահուստային Ուղևորություն

# error_region_unsupported
source: Region is not supported.
am: በዚህ አካባቢ ለጊዜው አገልግሎት አልጀመርንም
ar: لم يتم التعرف على المنطقة
fa: منطقه پشتیبانی نمیشود.
hy: Տարածաշրջանը չի աջակցվում:

# action_confirm
source: Confirm
am: ያረጋግጡ
ar: تأكيد
fa: تایید
hy: Հաստատել

# title_wait_time
source: Wait time
ar: وقت الانتظار
fa: مدت انتظار
hy: Սպասեք ժամանակ

# notice_tip_title
source: Would you like to add a tip?
am: ተጨማሪ Tip መስጠት ይፈልጋሉ?
ar: هل تريد اضافة عمولة؟
fa: آیا تمایل به اضافه کردن انعام دارید؟
hy: Կցանկանայի՞ք հուշում ավելացնել:

# notice_tip_description
source: Adding tip is optional. You can add any amount you like as a tip for the driver.
am: Tip መስጠት አማራጭ ነው። ለሹፌሩ የፈለጉትን ያህል መጠን Tip ማከል ዎይም መስጥት ይችላሉ።
ar: يمكنك اضافة أي قيمة كعمولة للسائق
fa: اضافه کردن انعام اختیاری است. شما هر مقداری که تمایل دارید میتوانید اضافه کنید.
hy: Հուշում ավելացնելը պարտադիր չէ: Դուք կարող եք ավելացնել ցանկացած գումար, որը ցանկանում եք, որպես թեյավճար վարորդի համար:

# action_pay_for_ride
source: Pay for ride
am: ለአገልግልቱ ይክፈሉ።
ar: ادفع للرحلة
fa: پرداخت برای سفر
hy: Վճարեք զբոսանքի համար

# action_confirm_and_pay
source: Confirm & Pay
am: ያረጋግጡ እና ይክፈሉ
ar: تأكيد ودفع
fa: تایید و پرداخت
hy: Հաստատեք և վճարեք

# action_add_photo
source: Add Photo
am: ፎቶ ያስገቡ
ar: اضافة صورة
fa: اضافه کردن تصویر
hy: Ավելացնել լուսանկար

# complaint_submit_success_message
source: Complaint is submitted. Please wait for a contact from our support representative about your inquiry.
am: ቅሬታዎን ተቀብልናል። እባክዎን ስለጥያቄዎን የድጋፍ ወኪሎቻቸን እስኪገናኙ ይጠብቁ።
ar: تم ارسال الشكوى
fa: شکایت ثبت شد. منتظر تماس تیم پشتیبانی باشید.
hy: Բողոք է ներկայացվում։ Խնդրում ենք սպասել մեր աջակցության ներկայացուցչի կողմից ձեր հարցման վերաբերյալ կապի:

# error_field_cant_be_empty
source: Can not be empty
am: ባዶ መሆን አይቻልም
ar: لا يمكن ترك الخانة فارغة
fa: نمی تواند خالی باشد
hy: Չի կարող դատարկ լինել

# issue_description_placeholder
source: Write a description of your issue...
am: ስለጉዳይዎ ማብራሪያ ይጻፉ…
ar: اكتب وصف للمشكلة
fa: درباره مشکلتان توضیح دهید
hy: Գրեք ձեր խնդրի նկարագրությունը...

# issue_subject_placeholder
source: Subject
ar: الموضوع
fa: عنوان
hy: Առարկա

# issue_submit_description
source: You can report any issue you had with your ride. We will help you with the issue within a call.
am: በጉዞዎ ላይ ያለዎትን ማንኛውንም ችግር ሪፖርት ማድረግ ይችላሉ። ስለ በጉዳዩ በእጅ ስልኮ በመደውል እንረዳዎታለን.
ar: تستطيع رفع بلاغ بأي اشكالية وسوف يتم التواصل معك في أقرب وقت ممكن
fa: شما میتوانید هر مشکلی که با سفرتان داشتید را گزارش دهید. ما با تماس کمکتان خواهید کرد.
hy: Դուք կարող եք զեկուցել ձեր ուղևորության հետ կապված ցանկացած խնդրի մասին: Մենք ձեզ կօգնենք հարցի շուրջ զանգի ընթացքում։

# issue_submit_title
source: Report an issue
am: ሪፖርት ስለሚያደርጉት ጉዳይ
ar: رفع بلاغ
fa: گزارش مشکل
hy: Հաղորդել խնդրի մասին

# issue_submit_button
source: Report issue
am: ችግሮን ሪፖርት ያድርጉ
ar: رفع بلاغ
fa: ثبت گزارش
hy: Հաղորդել խնդրի մասին

# trip_information_title
source: Trip Information
am: የጉዞ መረጃ
ar: معلومات الرحلة
fa: اطلاعات سفر
hy: Ուղևորության մասին տեղեկատվություն

# payment_in_cash
source: Cash
am: ካሽ
ar: نقدي
fa: نقدی
hy: Կանխիկ

# payment_method_title
source: Payment Method
am: የመክፈያ ዘዴ
ar: طرق الدفع
fa: شیوه پرداخت
hy: Վճարման եղանակ

# button_ride_safety
source: Ride Safety
am: የጉዞ ደህንነት
ar: سلامة الرحلة
fa: امنیت سفر
hy: Ուղևորության անվտանգություն

# status_title_driver_arrived
source: Meet driver at pickup point
am: የመውሰጃ ቦታ ላይ ሾፌሩን ያግኙ
ar: السائق على وشك الوصول
fa: راننده در انتظار شماست
hy: Հանդիպեք վարորդին պիկապ կետում

# status_title_trip_started
source: Heading to destination
am: ወደ መድረሻው በመሄድ ላይ ነው
ar: ذاهب للوجهة
fa: به سمت مقصد
hy: Ուղևորություն դեպի նպատակակետ

# welcome_card_subtitle
source: Where are you going?
am: ወዴት ነው የምትሄደት?
ar: إلى أين الوجهة
fa: به کجا می روید؟
hy: Ուր ես գնում?

# welcome_card_textbox_placeholder
source: Where is your destination?
am: መድረሻዎ ወዴት ነው?
ar: أين وجهتك؟
fa: مقصدتان را وارد کنید
hy: Որտե՞ղ է ձեր նպատակակետը:

# welcome_card_greeting
source: Hello {firstName}!
ar: {firstName}هلا
fa: سلام{firstName}!
hy: Բարև{firstName}:

# login_title
source: Sign In
am: ይግቡ
ar: تسجيل الدخول
fa: ورود به حساب
hy: Մուտք գործել

# login_body
source: First, you must sign in to book your ride. A verification code will be sent to your phone number.
am: በመጀመሪያ፣ የጉዞ ቦታዎን ለማስያዝ በመለያ መግባት አለብዎት። የማረጋገጫ ኮድ ወደ ስልክ ቁጥርህ ይላካል።
ar: يجب تسجيل الدخول لحجز رحلة
fa: یک کد برای شما ارسال خواهد شد. برای درخواست سفر شما نیاز به تایید شماره تماس خود دارید.
hy: Նախ, դուք պետք է մուտք գործեք ձեր ուղևորությունը պատվիրելու համար: Ձեր հեռախոսահամարին կուղարկվի հաստատման կոդը:

# terms_and_condition_text
source: I have read and agree with
am: አንብቤ ተስማምቻለሁ
ar: تم القراءة والمواققة على الشروط
fa: من مطالعه کردم و قبول دارم
hy: Ես կարդացել եմ և համաձայն եմ

# terms_and_condition_button
source: Terms & Conditions
am: ውሎች እና ሁኔታዎች
ar: الشروط والاحكام
fa: شرابط استفاده از خدمات را
hy: Պայմաններ եւ դրույթներ

# login_verify_code_title
source: Enter code
am: ኮድ ያስገቡ
ar: ادخل الرمز
fa: کد را وارد کنید
hy: Մուտքագրեք կոդը

# login_verify_code_body
source: Code has been sent to your phone number
am: ኮድ ወደ ስልክ ቁጥርዎ ተልኳል።
ar: تم ارسال الرمز إلى الجوال
fa: کد برای شما ارسال شده است
hy: Կոդն ուղարկվել է ձեր հեռախոսահամարին

# action_continue
source: Continue
am: ይቀጥሉ
ar: المتابعة
fa: ادامه
hy: Շարունակել

source: Current Location
am: አሁን ያሉበት ቦታ
ar: الموقع الحالي
fa: مکان فعلی
hy: Ընթացիկ գտնվելու վայրը

source: Your destination
am: የእርሶ መድረሻ
ar: وجهتك
fa: مقصد
hy: Ձեր նպատակակետը

source: Add Stop
am: ማቆሚያ ይጨምሩ
ar: اضافة نقطة
fa: مقصد بین راهی
hy: Ավելացնել Stop

# action_choose_on_map
source: choose on map
am: በካርታው ላይ ይምረጡ
ar: اختيار على الخريطة
fa: انتخاب روی نقشه
hy: ընտրել քարտեզի վրա

# message_title_location
source: Location
am: አካባቢ/ቦታ
ar: الموقع
fa: مکان
hy: Գտնվելու վայրը

# message_body_location
source: We could not get your current location from your device's GPS. Please use the search field to select your pickup location.
am: አሁን ያሉበት ቦታ ከስልክዎ ጂፒኤስ ማግኘት አልቻልንም። እባክዎን የመፈለጊያ ቦታዎን በመጠቀም የመንሻ ቦታዎን ይምረጡ።
ar: لم يتم التعرف على موقعك الحالي، نرجو كتابة الموقع اعلاه
fa: ما نتوانستیم به کمک جی پی اس مکان شمارا دریافت کنیم. لطفا مکان فعلی را بصورت دستی در نقشه مشخص کنید.
hy: Մենք չկարողացանք ստանալ ձեր ընթացիկ գտնվելու վայրը ձեր սարքի GPS-ից: Խնդրում ենք օգտագործել որոնման դաշտը՝ ձեր տեղափոխման վայրը ընտրելու համար:

# menu_reserved_rides
source: Reserved Rides
am: የተያዘ ጉዞ
ar: الرحلات المحجوزة
fa: سفرهای رزور شده
hy: Վերապահված զբոսանքներ

# reservation_empty_state_title
source: No Reservations!
am: ጉዞ አልተያዘም!
ar: لا حجوزات قادمة
fa: بدون رزرو!
hy: Առանց վերապահումների:

# reservation_empty_state_body
source: You will be able to see your future bookings once you make them on the main screen.
am: የወደፊት ቦታ ማስያዣዎችዎን በዋናው ማያ ገጽ ላይ ካደረጉት በኋላ ማየት ይችላሉ።
ar: ستتمكن من رؤية حجوزاتك المستقبلية بعد الحجز
fa: شما در این صفحه قادر خواهید بود سفرهای آینده خود را مشاهده کنید.
hy: Դուք կկարողանաք տեսնել ձեր ապագա ամրագրումները, երբ դրանք կատարեք հիմնական էկրանին:

# action_cancel_ride
source: Cancel Ride
am: ጉዞ ይሰርዙ
ar: إلغاء الرحلة
fa: انصراف از سفر
hy: Չեղարկել Ուղևորությունը

# enum_address_type_gym
source: Gym
am: ጂም
ar: نادي
fa: باشگاه
hy: մարզասրահ

# enum_address_type_parent_house
source: Parent's House
am: የእርስዎ ቤት
ar: بيت العائلة
fa: منزل والدین
hy: Ծնողական տուն

# enum_address_type_cafe
source: Cafe
am: ካፌ
ar: مقهى
fa: کافی شاپ
hy: Սրճարան

# enum_address_type_park
source: Park
am: ፓርክ
ar: حديقة
fa: پارک
hy: Պուրակ

# action_add_favorite_location
source: Add Favorite location
am: ተወዳጅ ቦታን ጨምር
ar: اضافة المواقع المفضلة
fa: اضافه کردن مقصد مورد علاقه
hy: Ավելացնել սիրելի գտնվելու վայրը

# favorite_locations_list_title
source: Favorite locations
am: ተወዳጅ ቦታዎች
ar: المواقع المفضلة
fa: مقصدهای موردعلاقه
hy: Սիրված վայրերը

# favorite_locations_list_body
source: You can save your favorite locations for easier access
am: በቀላሉ ለመድረስ የሚወዷቸውን ቦታዎች ማስቀመጥ ይችላሉ።
ar: تستطيع حفظ المواقع المفضلة لتسهيل عملية الوصول لهم
fa: شما میتوانید مقصدهای مورد علاقه خود را برای دسترسی آسان تر ذخیره کنید
hy: Դուք կարող եք պահպանել ձեր նախընտրած վայրերը՝ ավելի հեշտ մուտք գործելու համար

# favorite_location_details_title
source: Name your favorite location
am: የሚወዱትን ቦታ ይሰይሙ
ar: اسم الموقع المفضل
fa: اطلاعات مقصد مورد علاقه را وارد کنید
hy: Անվանեք ձեր նախընտրած վայրը

# textbox_error_select_type_address
source: Please select the type of address
am: እባክዎ የአድራሻውን አይነት ይምረጡ
ar: اختر نوع الموقع المفضل
fa: لطفا نوع مقصد را مشخص کنید
hy: Խնդրում ենք ընտրել հասցեի տեսակը

# placeholder_type
source: Type
am: ዓይነት
ar: النوع
fa: نوع
hy: Տիպ

# action_delete_account
source: Delete Account
am: መለያ ሰርዝ
ar: حذف الحساب
fa: حذف حساب کاربری
hy: Հաշիվը ջնջել

# message_delete_account_title
source: Account deletion
am: መለያ ስረዛ
ar: حذف الحساب
fa: حذف حساب
hy: Հաշվի ջնջում

# message_delete_account_body
source: Are you sure you want to delete your account? You can log in again within 30 days to restore the account. After this period, your data gets completely removed, including all your remaining credits.
am: እርግጠኛ ነህ መለያህን መሰረዝ ትፈልጋለህ? መለያውን ወደነበረበት ለመመለስ በ30 ቀናት ውስጥ እንደገና መግባት ይችላሉ። ከዚህ ጊዜ በኋላ፣ ሁሉንም ቀሪ ክሬዲቶችዎን ጨምሮ ውሂብዎ ሙሉ በሙሉ ይወገዳል።
ar: هل أنت متأكد من حذف الحساب؟ تستطيع الدخول خلال 30 يوم لتنشيط الحساب. بعد هذه المدة سيتم حذف الحساب مع كافة بياناته شاملاً ذلك المبالغ المتبقية
fa: آیا از حذف حساب مطمئنید؟ تا ۳۰ روز پس از حذف با ورود مجدد به حسابتان می توانید حساب خود را بازیابی کنید. پس از آن تمام اطلاعات حساب شما حذف خواهد شد.
hy: Իսկապե՞ս ուզում եք ջնջել ձեր հաշիվը: Հաշիվը վերականգնելու համար կարող եք նորից մուտք գործել 30 օրվա ընթացքում: Այս ժամանակահատվածից հետո ձեր տվյալները ամբողջությամբ կջնջվեն, ներառյալ ձեր մնացած բոլոր վարկերը:

# action_edit
source: Edit
am: አርትዕ
ar: تعديل
fa: ویرایش
hy: Խմբագրել

# action_confirm_location
source: Confirm location
am: ያሉበትን ቦታ ያረጋግጡ
ar: تأكيد الموقع
fa: تائید مکان
hy: Հաստատեք գտնվելու վայրը

# action_coupon_code
source: Coupon Code
am: የኩፖን ኮድ
ar: رمز الخصم
fa: کد کوپن
hy: Կտրոնի կոդը

# enter_coupon_dialog_title
source: Coupon Code
am: የኩፖን ኮድ
ar: رمز الخصم
fa: کد کوپن
hy: Կտրոնի կոդը

# enter_coupon_dialog_body
source: Insert your coupon code to be applied to the price
am: በዋጋው ላይ እንዲተገበር የኩፖን ኮድዎን ያስገቡ
ar: ادخل رمز الخصم لتطبيقه على المبلغ
fa: کد کوپن را در اینجا وارد کنید
hy: Տեղադրեք ձեր կուպոնի կոդը, որը կկիրառվի գնի վրա

# enter_coupon_placeholder
source: Enter coupon code
am: የኩፖን ኮድ ያስገቡ
ar: ادخال رمز الخصم
fa: ورود کد کوپن
hy: Մուտքագրեք կտրոնի կոդը

# looking_dialog_title
source: Ride Requested
am: ጉዞ አዞዋል
ar: تم ارسال طلب الرحلة
fa: سرویس درخواست شده
hy: Ուղևորություն է պահանջվում

# looking_dialog_body
source: We are looking for the nearest driver for you.
am: ለእርስዎ ቅርብ የሆነውን ሹፌር እየፈለግን ነው።
ar: يتم البحث على سائق
fa: ما در جستجوی نزدیک ترین راننده برای شما هستیم
hy: Մենք փնտրում ենք ձեզ մոտակա վարորդին։

# action_cancel_request
source: Cancel Request
am: ትዕዛዙን ይሰሪዙ
ar: إلغاء الطلب
fa: انصراف از درخواست
hy: Չեղարկել հարցումը

# rate_ride_title
source: How was your ride?
am: ጉዞህ እንዴት ነበር?
ar: كيف كانت رحلتك؟
fa: سفرتان چگونه بود؟
hy: Ինչպիսի՞ն էր ձեր ճանապարհորդությունը:

# rate_ride_body
source: Help us improve your experience by rating your driver
am: ለአሽከርካሪዎ ደረጃ በመስጠት ልምድዎን እንድናሻሽል ያግዙን።
ar: ساعدنا بتطوير الخدمة بتقييم قائد المركبة
fa: با ثبت نظرات خود در بهبود خدمات ما را یاری کنید.
hy: Օգնեք մեզ բարելավել ձեր փորձը՝ գնահատելով ձեր վարորդին

# rate_ride_good_points
source: Nice Points
am: ቆንጆ ነጥብ
ar: نقاط ايجابية
fa: نکات مثبت
hy: Հաճելի միավորներ

# rate_ride_negative_points
source: Negative Points
am: አሉታዊ ነጥብ
ar: نقاط سلبية
fa: نکات منفی
hy: Բացասական միավորներ

# rate_ride_comment_title
source: Add comment
am: አስተያየት ያክሉ
ar: اضافة تعليق
fa: توضیحات
hy: Ավելացնել մեկնաբանություն

# rate_ride_comment_placeholder
source: write your comment ...
am: አስተያየትዎን ይፃፉ…
ar: اكتب تعليقك هنا
fa: توضیحات اضافه را در این کادر وارد کنید
hy: գրեք ձեր մեկնաբանությունը...

# action_send_feedback
source: Send Feedback
am: ግብረመልስ ይላኩ
ar: ارسال التعليق
fa: ارسال بازخورد
hy: Ուղարկել գնահատական

# action_ride_options
source: Ride Options
am: የጉዞ አማራጮች
ar: خيارات الرحلة
fa: گزینه های سفر
hy: Ուղևորության ընտրանքներ

# ride_options_title
source: Ride Options
am: የጉዞ አማራጮች
ar: خيارات الرحلة
fa: گزینه های سفر
hy: Ուղևորության ընտրանքներ

# ride_options_wait_time_action
source: Wait time
am: የቆይታ ጊዜ
ar: وقت الانتظار
fa: زمان انتظار
hy: Սպասեք ժամանակ

# ride_safety_title
source: Ride Safety
am: የጉዞ ደህንነት
ar: سلامة الرحلة
fa: امنیت سفر
hy: Ուղևորության անվտանգություն

# ride_safety_share_trip_information
source: Share trip information
am: የጉዞ መረጃን ያጋሩ
ar: مشاركة معلومات الرحلة
fa: اشتراک گذاری اطلاعات سفر
hy: Կիսվեք ուղևորության մասին տեղեկություններով

# ride_safety_sos
source: SOS
ar: خطر
fa: سیگنال خطر

# sos_title
source: Distress Signal
am: የአደጋ ምልክት
ar: اشعار خطر
fa: سیگنال خطر
hy: Աղետի ազդանշան

# sos_body
source: Distress signals are for emergencies and call to authorities such as police might be made on your behalf. Please use this feature only in emergencies that you might be in danger.
am: የአደጋ ምልክቱ ለአደጋ ጊዜ እርስዎን ለመርዳት እንደ ፖሊስ ያሉ ህግ አስከባሪዎች ያሉበት ድርስ ይመጣሉ። እባኮትን ይህንን የአደጋ ጥሪ እርስዎ አደጋ ላይ ሊወድቁ በሚችሉ ሁኔታዎች ውስጥ ብቻ ይጠቀሙ።
ar: نرجو استخدام هذه الميزة في اوقات الخطر
fa: سیگنال خطر جهت موارد ضروری استفاده می گردد که امنیت شما یا راننده در خطر است. با انتخاب این گزینه ممکن است از سمت شما با پلیس تماس گرفته شود.
hy: Աղետի ազդանշանները արտակարգ իրավիճակների համար են, և ձեր անունից կարող են զանգահարել այնպիսի իշխանություններին, ինչպիսին է ոստիկանությունը: Խնդրում ենք օգտագործել այս հնարավորությունը միայն արտակարգ իրավիճակներում, որոնք կարող են վտանգված լինել:

# sos_sent_alert
source: SOS is sent
am: SOS/የአደጋ ጊዜ ጥሪ ተልኳል።
ar: طلب نجدة
fa: سیگنال هشدار ارسال شد
hy: SOS ուղարկված է

# sos_ok_action
source: It's an emergency
am: ድንገተኛ አደጋ ነው።
ar: خطير جداً
fa: تائید میکنم
hy: Արտակարգ դեպք է

# share_trip_text_locations
source: I am on my way to {destination} from {pickup}.
ar: {destination} في طريقي إلى .
fa: من در مسیرم به سمت {destination} از {pickup} هستم.
hy: Ես ճանապարհին եմ դեպի {destination} {picup}-ից:

# share_trip_text_driver
source: My driver name is {firstName} {lastName} and his mobile number is +{mobileNumber}.
am: የሹፌሩ ስም {firstName} {lastName} እና የሞባይል ቁጥሩ +{mobileNumber}.
ar: {mobileNumber} ورقم جوالي {lastName} {firstName} اسمي
fa: نام راننده ام {firstName} {lastName} و شماره موبایلش +{mobileNumber} است.
hy: Իմ վարորդի անունն է {firstName} {lastName} և նրա բջջային համարը +{mobileNumber}:

# share_trip_started_time
source: Trip has started on {startTime} and i expect the trip to take around {duration} minutes
ar: دقيقة {duration} وستنتهي خلال {startTime} بدآت الرحلة
fa: سفرم در ساعت {startTime} شروع شد و انتظار دارم حدود {duration} دقیقه طول بکشد.
hy: Ուղևորությունը սկսվել է {startTime}-ին, և ես ակնկալում եմ, որ ճանապարհորդությունը կտևի մոտ {duration} րոպե

# share_trip_not_arrived_time
source: I expect the trip itself take around {duration} minutes once i get on the driver's car.
ar: دقيقة {duration} الوقت المتوقع
fa: انتظار دارم سفرم از زمانی که سوار ماشین شوم {duration} دقیقه طول بکشد.
hy: Ես ակնկալում եմ, որ ճանապարհորդությունն ինքնին տևում է մոտ {duration} րոպե, երբ ես նստեմ վարորդի մեքենան:

# announcements_empty_state_title
source: No Announcements yet!
am: እስካሁን ምንም ማስታወቂያዎች የሉም!
ar: لا اشعارات حتى الآن
fa: بدون اطلاعیه!
hy: Դեռևս հայտարարություններ չկան:

# announcements_empty_state_body
source: We will notify you when new announcements comes.
am: አዲስ ማስታወቂያዎች ሲመጡ እናሳውቅዎታለን።
ar: !من يصير في شيء جديد بنعلمك
fa: اطلاعیه های جدید را در این قسمت میتوانید مشاهده کنید.
hy: Մենք ձեզ կտեղեկացնենք, երբ նոր հայտարարություններ լինեն։

# action_set_location
source: Set Location
am: ቦታውን ያዘጋጁ
ar: حدد الموقع
fa: انتخاب مکان
hy: Սահմանել տեղադրությունը

# trip_history_empty_state_title
source: No Records!
am: ምንም የተምዘገበ የለም!
ar: لا بيانات سابقة
fa: یافت نشد!
hy: Ոչ մի գրառում:

# location_not_found_alert_dialog_title
source: Location
am: ቦታ
ar: الموقع
fa: مکان
hy: Գտնվելու վայրը

# location_not_found_alert_dialog_body
source: We could not get your current location using your device's GPS. Please check the device location permission for the app from the device's settings. Alternatively, you can use the search field above to select your pick-up point.
am: የእርስዎን የስልክ ጂፒኤስ በመጠቀም አሁን ያለዎትን ቦታ ማግኘት አልቻልንም። እባኮትን ከስልኮን መተግበሪያው መቼት በመጠቀም የስልኮን የአካባቢ ፍቃድ ያረጋግጡ። Alternatively, የመንሻ ቦታዎን ለመምረጥ ከላይ ያለውን የፍለጋ መስክ መጠቀም ይችላሉ.
ar: لم يتم الوصول إلى موقعك، نرجو تحديد الموقع اعلاه
fa: ما نتوانستیم به کمک جی پی اس مکان شما را بیابیم. شما می توانید به صورت دستی مکان خود را وارد کنید.
hy: Մենք չկարողացանք ստանալ ձեր ընթացիկ գտնվելու վայրը՝ օգտագործելով ձեր սարքի GPS-ը: Խնդրում ենք ստուգել սարքի տեղադրության թույլտվությունը հավելվածի համար սարքի կարգավորումներից: Որպես այլընտրանք, դուք կարող եք օգտագործել վերևի որոնման դաշտը՝ ձեր հավաքման կետն ընտրելու համար:

# gift_card_title
source: Enter Gift Code
am: የስጦታ ኮድ ያስገቡ
ar: ادخل رمز الخصم
fa: کارت هدیه
hy: Մուտքագրեք նվեր կոդը

# gift_card_body
source: Enter your gift card code
am: የስጦታ ካርድ ኮድዎን ያስገቡ
ar: ادخل رمز الخصم
fa: کد کارت هدیه را در کادر زیر وارد کنید.
hy: Մուտքագրեք ձեր նվեր քարտի կոդը

# gift_card_text_placeholder
source: Enter gift card code
am: የስጦታ ካርድ ኮድ ያስገቡ
ar: ادخل رمز الخصم
fa: کد کارت هدیه را وارد کنید
hy: Մուտքագրեք նվեր քարտի կոդը

# action_apply
source: Apply
am: ያመልክቱ
ar: تطبيق
fa: ثبت
hy: Դիմել

# order_status_should_be_arrived
source: should be arrived
am: መድረስ አለበት
ar: على وشك الوصول
fa: راننده رسیده است
hy: պետք է ժամանել

# order_status_arriving_in
source: Arriving in {minutes} mins
am: Arriving in {minutes}
ar: {minutes} يصل خلال
fa: در {minutes} دقیقه میرسد
hy: Ժամանում {րոպեից}

# message_title_warning
source: Warning
am: ማስጠንቀቂያ
ar: تحذير
fa: هشدار
hy: Զգուշացում
